### *Pandas를 이용해서 순위를 출력하는 방법
```sql
select ename, sal, rank() over (order by sal desc) 순위
    from emp;
    ```
*Pandas를 이용해서 파생변수 생성하는 방법 (column추가)   
```python
import pandas as pd
emp=pd.read_csv('k:/Itwill/2. Python/자료/emp3.csv')

emp['rnk']=emp['sal'].rank(ascending=False).apply(int)
emp
```

In [11]:
import pandas as pd
emp=pd.read_csv('k:/Itwill/2. Python/자료/emp3.csv')

emp['rnk']=emp['sal'].rank(ascending=False).apply(int)
emp.sort_values('rnk',ascending=True) # 순위를 1등부터 나오게 정렬

,index,empno,ename,job,mgr,hiredate,sal,comm,deptno,rnk
0,1,7839,KING,PRESIDENT,NaN,1981-11-17 0:00,5000,NaN,10,1
9,10,7902,FORD,ANALYST,7566.0,1981-12-11 0:00,3000,NaN,20,2
11,12,7788,SCOTT,ANALYST,7566.0,1982-12-22 0:00,3000,NaN,20,2
3,4,7566,JONES,MANAGER,7839.0,1981-04-01 0:00,2975,NaN,20,4
1,2,7698,BLAKE,MANAGER,7839.0,1981-05-01 0:00,2850,NaN,30,5
2,3,7782,CLARK,MANAGER,7839.0,1981-05-09 0:00,2450,NaN,10,6
5,6,7499,ALLEN,SALESMAN,7698.0,1981-02-11 0:00,1600,300.0,30,7
6,7,7844,TURNER,SALESMAN,7698.0,1981-08-21 0:00,1500,0.0,30,8
13,14,7934,MILLER,CLERK,7782.0,1982-01-11 0:00,1300,NaN,10,9
4,5,7654,MARTIN,SALESMAN,7698.0,1981-09-10 0:00,1250,1400.0,30,10
8,9,7521,WARD,SALESMAN,7698.0,1981-02-23 0:00,1250,500.0,30,10
12,13,7876,ADAMS,CLERK,7788.0,1983-01-15 0:00,1100,NaN,20,12
7,8,7900,JAMES,CLERK,7698.0,1981-12-11 0:00,950,NaN,30,13
10,11,7369,SMITH,CLERK,7902.0,1980-12-09 0:00,800,NaN,20,14

### ※ 문제150. 아래의 SQL을 Pandas로 구현하시오
```sql
select ename, sal, job, rank() over (order by sal desc)
    from emp
    where job='SALESMAN';
    ```

In [13]:
result=emp[['ename','sal','job']][emp['job']=='SALESMAN']
result['rank']=result['sal'].rank(ascending=False).apply(int)
result.sort_values('rank',ascending=True)

    ename   sal       job  rank
5   ALLEN  1600  SALESMAN     1
6  TURNER  1500  SALESMAN     2
4  MARTIN  1250  SALESMAN     3
8    WARD  1250  SALESMAN     3

### ※ 문제151. 아래의 SQL을 판다스로 구현하시오
```sql
select deptno, job, sum(sal)
    from emp
    group by deptno, job;
    ```

In [47]:
import pandas as pd
emp=pd.read_csv('k:/Itwill/2. Python/자료/emp3.csv')
emp2=emp.groupby(['deptno','job'])['sal'].sum().reset_index()
emp2.sort_values(['deptno','job'])

   deptno        job   sal
0      10      CLERK  1300
1      10    MANAGER  2450
2      10  PRESIDENT  5000
3      20    ANALYST  6000
4      20      CLERK  1900
5      20    MANAGER  2975
6      30      CLERK   950
7      30    MANAGER  2850
8      30   SALESMAN  5600

### ※ 문제152. 위에 출력된 column명 sal이 한글로 토탈월급으로 출력되게 하시오

In [49]:
emp2=emp.groupby(['deptno','job'])['sal'].sum().reset_index()
emp2.columns.values[2]='토탈월급'
emp2

   deptno        job  토탈월급
0      10      CLERK  1300
1      10    MANAGER  2450
2      10  PRESIDENT  5000
3      20    ANALYST  6000
4      20      CLERK  1900
5      20    MANAGER  2975
6      30      CLERK   950
7      30    MANAGER  2850
8      30   SALESMAN  5600

### ※ 문제153. 아래의 SQL을 Pandas로 구현하시오
```sql
select job, sum(sal)
    from emp
    group by job
    having sum(sal) >= 6000
    order by sum(sal) desc;
    ```

In [50]:
emp2=emp.groupby('job')['sal'].sum().reset_index()
emp3=emp2[['job','sal']][emp2['sal']>=6000].sort_values('sal',ascending=False)
emp3

       job   sal
2  MANAGER  8275
0  ANALYST  6000

### ■ 예제68. 반올림수 구하기(round)
#### 파이썬 내장함수 round()는 인자로 입력된 수치형 자릿수에서 반올림한 결과를 리턴

In [54]:
# 예제
print(round(16.554)) # 첫째자리에서 반올림
print(round(16.554,0))
print(round(16.554,1)) # 둘째자리에서 반올림 16.6
print(round(16.554,2)) # 셋째자리에서 반올림 16.55

print(round(142.5)) # 142 출력

17
17.0
16.6
16.55
142

#### R과 파이썬은 짝수를 좋아함
    142.5 ---------> 142
    187.5 ---------> 188
    2    <-    2.5          3
    7          7.5    ->    8
#### 파이썬은 기본적으로 이것을 해결하는 함수가 없다.
0.5일 때는 짝수를 좋아하게끔 반올림되고 0.51일 때는 반올림된다

### ■ 예제69. 실수형 자료를 정수형 자료로 변환하기(int())
- 파이썬의 변환 함수 정리
```
                데이터 유형       변환함수
    - 정수형        int            int()
    - 문자형        str            str()
    - 실수형        float          float()
    - 리스트형      list           list()
    - 튜플형        tuple          tuple()
```

#### 코드 작성시 수학 연산을 하다보면 정수끼리만 계산해야하는 경우가 있는데 데이터가 실수형이라면 정수형으로 변환 후 계산
#### 파이썬 내장함수 int()는 인자로 입력된 실수형 자료를 정수형 자료로 변환
#### int()는 입력된 실수형 자료의 소수부분은 버리고 정수부분만 취하여 정수값으로 리턴

In [55]:
# 예제
print(int(-5.4))

-5

### ※ 문제154. 이름, 월급을 출력하는데 월급을 출력할 때 소숫점 이하가 나오게 하시오

In [67]:
emp['sal']=emp['sal'].apply(float)
emp[['ename','sal']]

     ename     sal
0     KING  5000.0
1    BLAKE  2850.0
2    CLARK  2450.0
3    JONES  2975.0
4   MARTIN  1250.0
5    ALLEN  1600.0
6   TURNER  1500.0
7    JAMES   950.0
8     WARD  1250.0
9     FORD  3000.0
10   SMITH   800.0
11   SCOTT  3000.0
12   ADAMS  1100.0
13  MILLER  1300.0

### ■ 예제70. 정수형 자료를 실수형 자료로 변환하기(float)
#### 이미지 처리나 공학용 프로그램을 작성할 때 실수형 끼리만 계산해야하는 경우가 많다
#### 데이터가 정수형이라면 정수형 자료를 실수형 자료로 변환한 후에 계산
#### 파이썬 내장함수 float()은 인자로 입력된 정수형 자료를 실수형으로 변환

In [69]:
# 예제
print(float(10))

10.0

### ※ 문제155. a=['1','2','3','4'] 리스트를 전부 숫자로 출력되게 하시오

In [73]:
a=['1','2','3','4']
for i in range(len(a)):
    a[i]=int(a[i])
print(a)

[1, 2, 3, 4]

In [74]:
a=['1','2','3','4']
list(map(int,a)) # a list의 요소를 하나씩 int() 적용

[1, 2, 3, 4]

### ※ 문제156. 아래의 리스트를 아래의 리스트로 변환하시오
    a=[1,2,3,4] -> a=['1','2','3','4']

In [75]:
a=[1,2,3,4]
for i in range(len(a)):
    a[i]=str(a[i])
print(a)

['1', '2', '3', '4']

In [76]:
a=[1,2,3,4]
list(map(str,a))

['1', '2', '3', '4']

### ■ 예제71. 정수형 리스트에서 짝수만 걸러내기(filter)
#### 파이썬 내장함수인 filter()는 리스트와 같이 반복 가능한 자료에서 특정 조건을 만족하는 값 만을 편리하게 추출할 수 있는 방법을 제공
```python
filter(param1,param2)
    param1 : 특정 조건의 값을 추출하는 함수 입력
    param2 : 리스트와 같이 반복 가능한 자료가 입력
        ```
#### 예제 : 숫자를 입력, 짝수이면 리턴, 홀수이면 값을 리턴하지 않는 함수를 get_even이라는 이름으로 생성

In [77]:
def get_even(n):
    if n%2==0:
        return n
    else:
        return

In [79]:
print(get_even(3))
print(get_even(10))

None
10

In [83]:
listdata=[1,2,3,4,5,6,7,8,9,10]
result=filter(get_even,listdata)
               #함수    처리해야할 리스트
list(result)

[2, 4, 6, 8, 10]

### ※ 문제157. 아래의 리스트에서 홀수만 추출하시오
```
listdata=[1,2,3,4,5,6,7,8,9,10]
```

In [88]:
def get_odd(n):
    if n%2==1:
        return n
    else:
        return
listdata=[1,2,3,4,5,6,7,8,9,10]
list(filter(get_odd, listdata))

[1, 3, 5, 7, 9]

### ※ 문제158. (파이썬 알고리즘 문제 29) 아래의 리스트에서 소수만 걸러내시오
```
listdata=[1,2,3,4,5,6,7,8,9,10]
```

In [122]:
def get_prime(n):
    cnt=0
    for i in range(1,n+1):
        if n%i==0:
            cnt += 1
    if cnt==2:
        return n
    else:
        return 
listdata=[1,2,3,4,5,6,7,8,9,10]
list(filter(get_prime, listdata))

[2, 3, 5, 7]

In [121]:
get_prime(8)

### ■ 예제72. 최댓값, 최솟값 구하기(max,min)
#### max(), min()은 인자로 입력된 자료에서 최대, 최솟값을 구해주는 함수
#### max()와 min()의 인자로 리스트와 같은 시퀀스 자료가 입력되면 시퀀스 자료의 요소 가운데 최댓값 또는 최솟값을 구하여 리턴
```
         오라클       vs       파이썬
          max                  max
          min                  min
          count                len
          sum                  sum
          avg                  mean
          ```

In [123]:
# 예제
listdata=[8,7,12,55,21,34,15,9,22]
max(listdata)

55

### ※ 문제159. 우리반 테이블을 Pandas의 DataFrame을 만들고 통신사를 뽑고 통신사별 최대 나이를 출력

In [127]:
import pandas as pd
emp11=pd.read_csv('k:/Itwill/2. Python/자료/emp11.csv')
rs=emp11[['telecom','age']]
rs1=rs.groupby('telecom')['age'].max().reset_index()
rs1

  telecom  age
0      kt   31
1      lg   28
2      sk   35

In [132]:
from my_loc import oracle as oc
oc.connect('emp11')
emp11

,empno,ename,birth,age,telecom,major,address,email,t_price
0,9,양선종,94/07/26,27,kt,전자공학,서울특별시 강남구 역삼동,cloudstrifey@naver.com,16500
1,2,박민호,94/08/21,27,kt,전자공학과,서울시 노원구 상계동,qkdkralsgh@naver.com,16500
2,7,강혜리,90/05/20,31,sk,광고홍보학과,서울시 노원구 공릉동,hyeri520@gmail.com,18000
3,17,위주희,86/08/19,35,sk,Forensic,서울시 강동구 상일동,wejuhee@gmail.com,18000
4,22,김유진,90/08/10,31,kt,국제회의통역,서울시 강동구 천호동,eujin2030@gmail.com,16500
5,10,김명환,94/01/07,27,kt,산공,경기도 수원시 율천동,kimmh6017@gmail.com,16500
6,3,최민혁,89/07/26,32,sk,방사선학과,서울시은평구,check5657@hanmail.net,18000
7,5,최유리,96/12/10,25,sk,통계학과,서울시 강서구 내발산동,gowrasd@naver.com,18000
8,1,김태환,89/08/17,32,sk,전자전기학과,경기도 하남시 풍산동,taewhan7725@gmail.com,18000
9,23,김지석,93/08/25,28,lg,신학과,경기도 평택시 지산동,yng1240@naver.com,17000
10,8,서동혁,95/09/29,26,sk,통계학과,서울시 강남구,tjehdgur0929@naver.com,18000
11,29,한태현,91/12/21,30,sk,행정학과,서울시 송파구 풍납동,thhan1@hanmail.net,18000
12,27,김서준,87/02/18,34,sk,수학,경기도 용인시 수지구,seojun.a.kim@gmail.com,18000
13,6,이준호,93/06/21,28,lg,경영학과,경기도 군포시 산본동,junho621@gmail.com,17000
14,16,조성원,89/02/09,32,sk,금융위험관리,서울특별시 광진구 자양동,seongwoncho2@gmail.com,18000
15,24,김은주,95/01/04,27,sk,디자인과,경기도 용인시 기흥구,dmswn0691@naver.com,18000
16,11,박상희,96/06/10,25,kt,컴퓨터공학과,경기도 용인시,estherp@naver.com,16500
17,12,조원기,95/11/09,26,sk,정보통신공학,서울특별시 마포구,chowk1109@naver.com,18000
18,4,안태형,92/12/02,29,sk,상담심리학과,서울시 서초구 방배본동,anntae1202@hanmai.net,18000
19,13,권민준,94/04/12,27,kt,전자전기학과,경기도 수원시 영통구,kmj1342567@naver.com,16500
20,26,이예라,94/10/14,27,sk,수학,서울시 강서구,yela2w2w@naver.com,18000
21,19,이서지,96/04/21,25,sk,게임공학과,경기도 광주시,dltjwl421@naver.com,18000
22,28,전지연,94/10/08,27,kt,수학과,인천광역시 부평구 갈산동,jeonjiy2on@naver.com,16500
23,20,박지성,91/07/06,30,sk,통계학과,서울시 관악구 신림로,ticano@naver.com,18000
24,15,정주희,97/03/02,24,lg,전정통,서울시 중랑구 중화동,dewy0302@icloud.com,17000
25,21,이승혁,95/02/28,26,kt,항공sw공학,경기도 화성시 반송동,sh2463@gmail.com,16500
26,18,김소애,92/01/20,29,kt,보건학,서울시 송파구,jazz_6@naver.com,16500
27,30,김현수,93/04/15,28,lg,식품생명과,경기도 의정부시 민락동,khs0415p@naver.com,17000
28,14,홍승희,94/06/20,27,kt,금융보험학과,서울시 화곡동,likebird888@naver.com,16500
29,25,이태환,92/07/22,29,sk,반도체공학과,서울시 구로구 항동,blush0722@gmail.com,18000

### ※(오늘의 마지막 문제) 아래의 SQL을 Pandas로 구현하시오
```sql
select job, count(*) as 인원수
    from emp
    group by job
    ```

In [163]:
emp=pd.read_csv('k:/Itwill/2. Python/자료/emp3.csv')
rs=emp[['empno','job']]
rs1=rs.groupby('job')['empno'].count().reset_index()
rs1.columns.values[1]='인원수'
rs1

         job  인원수
0    ANALYST    2
1      CLERK    4
2    MANAGER    3
3  PRESIDENT    1
4   SALESMAN    4

In [162]:
from my_loc import oracle as oc
emp=oc.connect('emp')
rs=emp[['EMPNO','JOB']]
rs1=rs.groupby('JOB')['EMPNO'].count().reset_index()
rs1.columns.values[1]='인원수'
rs1

         JOB  인원수
0    ANALYST    2
1      CLERK    4
2    MANAGER    3
3  PRESIDENT    1
4   SALESMAN    4